Configure/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// REFERENCE MATERIALS:
// https://openfoamwiki.net/images/f/f0/Final-AndrewJacksonSlidesOFW7.pdf
//

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    Bed
    {
        type triSurfaceMesh;
        file "Bed.stl";
    }
    Sample
    {
        type triSurfaceMesh;
        file "Sample.stl";
    }
};

castellatedMeshControls
{
    maxLocalCells 10000000;
    maxGlobalCells 20000000;
    minRefinementCells 0;
    //maxLoadUnbalance 0.50; 
    nCellsBetweenLevels 1;

    features
    (
		{ file "Bed.eMesh"; level 0; }
		{ file "Sample.eMesh"; level 0; }
	);

    resolveFeatureAngle 1;
    refinementSurfaces
    {
		Bed { level (0 0);  gapLevelIncrement 1;}
		Sample { level (0 0);  gapLevelIncrement 1;}
    }

    refinementRegions
    {
    }

    locationInMesh (0 0 0.005);
    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 5;
    tolerance 6.0;
    nSolveIter 15;
    nRelaxIter 10;
    nFeatureSnapIter 25;
    implicitFeatureSnap true;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    layers
    {
        Bed { nSurfaceLayers 1; }
		Sample { nSurfaceLayers 1; }
    }

	// finalLayerThickness and minThickness in meters when false
    relativeSizes false;
    firstLayerThickness 0.3e-3;
    minThickness 0.0001;
    expansionRatio 1.5;
    nGrow 0;

	// create surface layers at sharp corners (was 45)
    featureAngle 179;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
    nRelaxedIter 20;
}

meshQualityControls
{
    #include "meshQualityDict"
    nSmoothScale 6;
    errorReduction 0.75;
    relaxed	
    {maxNonOrtho 75;}
}

writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);

mergeTolerance 1E-7;

// ************************************************************************* //
