Configure/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"flowCondition"
dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform $velocity;

boundaryField
{
    Inlet      
    {
        type            flowRateInletVelocity;
		volumetricFlowRate	$flowrate;
        value           $internalField;

    }

    Outlet          
    {
        type                inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ".*"
    {
        type            noSlip;
    }

}

// ************************************************************************* //
