Configure/0/flowCondition
d50			%d50%;
flowrate 	%flowrate%;
velocity	(%U% 0 0);
k		%k%;
epsilon	%epsilon%;
nut		%nut%;

