Configure/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
setFormat raw;
surfaceFormat foam;
interpolationScheme cellPoint;
type surfaces;
fields
(
    wallShearStress
);

surfaces
(
    tau
    {
        type            patch;
	patches			("Sample")
        interpolate     true;
    }
);

// ************************************************************************* //
